package jun02;
// 이름 만들기
/*
 * 변수명, 클래스명, 메소드명, 상수명
 * 1. 사용 가능한 문자 : 영어 소문자, 대문자, 숫자, $, _
 * 		단 숫자는 이름 첫머리에 올수 없습니다.
 *  
 * 2. 클래스 이름 : 위 사용가능한 문자를 조합합니다.
 * 		단 반드시 첫 글자는 대문자이어야 합니다.
 * 		한 단어 이상의 단어들의 조합일 때는 새로운 단어
 * 		첫 머리 글자를 대문자로 합니다. = 파스칼 표기법
 * 
 * 3. 메소드명, 변수명 : 사용가능한 문자를 조합합니다.
 * 		첫 글자는 소문자로 시작합니다.
 * 		두 단어의 결합이라면 뒤에 오는 단어 첫 글자를 대문자		
 * 		= 카멜 표기법
 * 
 * 4. 상수명 : 모든 단어를 대문자로 구성합니다.
 * 		두 단어의 결합이라면 두 단어 사이에 _ 붙입니다.
 * 		스네이크 표기법
 * 
 * 5. 사용할 수 없는 이름 : 예약어는 사용 불가 합니다.
 * 		자바에서 프로그래밍 진행에 필요한 단어를 미리 등록
 * 		사용하고 있습니다.
 * 
 */

class AppleKorea {
	public static void main(String[] args) {
		int checkNumber = 10;
		int POINT_NUMBER = 10;
		int class1 = 100;
		String str = "";
	}
}

public class Variable02 {
	public static void main(String[] args) {
		int $num_Int123 = 10;
	}
}
